Repository: DHK-jv/Dermatology-Model-Agent
Catalog: endpoints/locale/*/LC_MESSAGES/django.po
Languages: vi

source: Possible {d} detected ({c:.1f}% confidence). For better accuracy: 1. Upload a clearer, closer photo 2. Ensure good lighting 3. Consult a dermatologist
vi: Có thể phát hiện {d} ({c:.1f}% độ tin cậy). Để có độ chính xác tốt hơn: 1. Tải lên ảnh rõ ràng, gần hơn 2. Đảm bảo ánh sáng tốt 3. Tham khảo ý kiến của bác sĩ da liễu

source: Explain this diagnosis
vi: Giải thích chẩn đoán này

source: Chat processing failed: {err}
vi: Xử lý chat thất bại: {err}

source: Server error: {err}
vi: Lỗi máy chủ: {err}

source: I specialize only in dermatology and skin health questions. Please ask me about skin conditions, treatments, or related medical concerns.
vi: Tôi chỉ chuyên về các câu hỏi về da liễu và sức khỏe da. Vui lòng hỏi tôi về các bệnh da, cách điều trị hoặc các vấn đề y tế liên quan.

source: I found these dermatologists matching your query: {list}
vi: Tôi đã tìm thấy những bác sĩ da liễu phù hợp với truy vấn của bạn: {list}

source: I couldn't find dermatologists matching your criteria. Would you like to expand your search?
vi: Tôi không thể tìm thấy bác sĩ da liễu phù hợp với tiêu chí của bạn. Bạn có muốn mở rộng tìm kiếm?

source: Could not process the image. Please try again with a clearer photo.
vi: Không thể xử lý ảnh. Vui lòng thử lại với ảnh rõ ràng hơn.

source: Search error: {err}
vi: Lỗi tìm kiếm: {err}

source: Failed to save interaction: {err}
vi: Không lưu được tương tác: {err}

source: Data sent to fabrics.
vi: Dữ liệu đã được gửi đến fabrics.

source: Kafka failed: {err}
vi: Kafka thất bại: {err}

source: WEBSITE_HOSTNAME environment variable is missing! Check Azure App Settings.
vi: Biến môi trường WEBSITE_HOSTNAME bị thiếu! Kiểm tra cài đặt Azure App.

source: MY_SECRET_KEY environment variable is missing! Check Azure App Settings.
vi: Biến môi trường MY_SECRET_KEY bị thiếu! Kiểm tra cài đặt Azure App.
